docs/type_theory.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-02-24 Wed 13:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Prerequisite type theory</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Vaibhav Karve" />
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Prerequisite type theory
<br />
<span class="subtitle">Quick type theory reference for understanding the model theory formalization  <br> <a href="model.html">model.lean</a>&nbsp;&nbsp;&nbsp;&nbsp;</span>
</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org76c7730">1. Types and terms</a></li>
<li><a href="#orgd92be4a">2. Types vs. Sets (and universes)</a></li>
<li><a href="#org252fe68">3. Props</a></li>
<li><a href="#orge299641">4. Finite types</a></li>
</ul>
</div>
</div>



<div id="outline-container-org76c7730" class="outline-2">
<h2 id="org76c7730"><span class="section-number-2">1</span> Types and terms</h2>
<div class="outline-text-2" id="text-1">
<p>
A <i>type</i> is a collection of distinct <i>terms</i> (very similar to how a set is a
collection of distinct values).
</p>

<p>
In set theory we write \((a \in A)\). In type theory we will instead write
\((a : A)\).
</p>
</div>
</div>

<div id="outline-container-orgd92be4a" class="outline-2">
<h2 id="orgd92be4a"><span class="section-number-2">2</span> Types vs. Sets (and universes)</h2>
<div class="outline-text-2" id="text-2">
<p>
Unlike sets, not all types are "on the same level". Each type belongs to a
universe.
</p>

<p>
Most types that we are familiar with are in universe level 0.
So, following statements are true &#x2013;
</p>
<div class="org-src-container">
<pre class="src src-lean">(<span class="org-constant">5</span> : <span class="org-constant">&#8469;</span>) <span class="org-comment-delimiter">-- </span><span class="org-comment">this says that 5 has type &#8469;</span>
(<span class="org-constant">&#8469;</span> : <span class="org-type">Type</span> <span class="org-constant">0</span>) <span class="org-comment-delimiter">-- </span><span class="org-comment">this says that &#8469;  has type level 0.</span>
(<span class="org-constant">&#8469;</span> : <span class="org-type">Type</span>)   <span class="org-comment-delimiter">-- </span><span class="org-comment">The default universe level is always 0.</span>
(list <span class="org-constant">&#8469;</span> : <span class="org-type">Type</span>) <span class="org-comment-delimiter">-- </span><span class="org-comment">A list of natural numbers has the same type as &#8469; itself</span>
(list <span class="org-type">Type</span> : <span class="org-type">Type</span> <span class="org-constant">1</span>) <span class="org-comment-delimiter">-- </span><span class="org-comment">A list of types belongs to a higher universe.</span>
</pre>
</div>

<p>
Note that <code>(list Type)</code> is a weird object that we will never have to deal with
in our day-to-day usage of lean.
</p>

<p>
<b>Important note:</b> Even though we use types instead of sets in lean, this does
not mean that lean has no sets! Sets in lean have their own meaning, distinct
from the sets we are used to in set theory.
</p>
</div>
</div>

<div id="outline-container-org252fe68" class="outline-2">
<h2 id="org252fe68"><span class="section-number-2">3</span> Props</h2>
<div class="outline-text-2" id="text-3">
<p>
<code>Prop</code> denotes the type of all propositions.  Props are types at a level below
Type 0. They are the type of all true/false statements.
</p>

<p>
Whenever we are dealing with a statement that might be true or false, it is of
type Prop.
</p>

<p>
Here are some example uses of Prop.
</p>
<div class="org-src-container">
<pre class="src src-lean">is_prime : <span class="org-constant">&#8469;</span> <span class="org-constant">&#8594;</span> <span class="org-type">Prop</span>
congruent_triangles : Triangle <span class="org-constant">&#8594;</span> Triangle <span class="org-constant">&#8594;</span> <span class="org-type">Prop</span>
greater_than_2 : <span class="org-constant">&#8477;</span> <span class="org-constant">&#8594;</span> <span class="org-type">Prop</span> <span class="org-constant">:=</span> <span class="org-constant">&#955;</span> (x : <span class="org-constant">&#8477;</span>), x <span class="org-constant">&gt;</span> <span class="org-constant">2</span>
</pre>
</div>

<p>
Note that <code>is_prime 5</code> is a term of type Prop, but so is <code>is_prime 6</code>.  We get
two Prop terms for free in lean <code>(true : Prop)</code> and <code>(false : Prop)</code>. For
everything else, we need a proof of equality. This means that <code>(is_prime 6 =
false)</code> is itself a Prop that needs a proof.
</p>
</div>
</div>

<div id="outline-container-orge299641" class="outline-2">
<h2 id="orge299641"><span class="section-number-2">4</span> Finite types</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org5ccfc0e" class="outline-3">
<h3 id="org5ccfc0e"><span class="section-number-3">4.1</span> empty</h3>
<div class="outline-text-3" id="text-4-1">
<p>
This is the type that contains no terms. (Think of this as an analogue of the
empty set).
</p>

<p>
Since empty has no terms, if you ever encounter an element <code>(a : empty)</code> then
this is an indication that we have made a mistake somewhere. This is similar to
how we can never have an element \(a \in \emptyset\).
</p>
</div>
</div>

<div id="outline-container-orgf12b01a" class="outline-3">
<h3 id="orgf12b01a"><span class="section-number-3">4.2</span> unit</h3>
<div class="outline-text-3" id="text-4-2">
<p>
This is the type that contains a exactly one term.
</p>

<p>
If we need a way to reference this term&#x2026;
</p>
<div class="org-src-container">
<pre class="src src-lean"><span class="org-keyword">#check</span> unit.star  <span class="org-comment-delimiter">-- </span><span class="org-comment">this has type unit</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">unit</span>
<span class="org-keyword">#check</span> ()  <span class="org-comment-delimiter">-- </span><span class="org-comment">this is another way to refer to unit.star</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">unit</span>
<span class="org-keyword">example</span> : () <span class="org-constant">=</span> unit.star <span class="org-constant">:=</span> rfl
</pre>
</div>

<p>
We can also think of this as the type of "truth" while empty is the type of
"false".
</p>
</div>
</div>

<div id="outline-container-orgd78c6ca" class="outline-3">
<h3 id="orgd78c6ca"><span class="section-number-3">4.3</span> bool</h3>
<div class="outline-text-3" id="text-4-3">
<p>
This is the type that contains exactly two terms. The terms are denoted <code>(tt :
bool)</code> and <code>(ff : bool)</code>. Note that bool is not the same as Prop, <code>tt</code> is not
the same as <code>true</code>, and <code>ff</code> is not the same as <code>false</code>.
</p>
</div>
</div>

<div id="outline-container-orgad9664a" class="outline-3">
<h3 id="orgad9664a"><span class="section-number-3">4.4</span> fin</h3>
<div class="outline-text-3" id="text-4-4">
<p>
<code>fin n</code> denotes the type that contains \(n\) elements. <code>fin 0</code>, <code>fin 1</code>, <code>fin 2</code>
have the special names <code>empty</code>, <code>unit</code>, and <code>bool</code> respectively.
</p>

<p>
Terms of <code>fin n</code> are merely the integers \(0\) to \(n-1\).
</p>

<p>
Use <code>fin</code> when you wish to construct a type with of a given cardinality.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Vaibhav Karve</p>
<p class="date">Created: 2021-02-24 Wed 13:43</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
